UniqueDroid/KaliberOS/components/board_hal/boards/watchy_v3/sdkconfig.defaults
# Watchy v3: ESP32-S3FN8, 8MB flash, NO PSRAM per the module part number
# (see board.c's caps comment - unverified against the actual populated
# module, confirm before trusting this over a schematic). CONFIG_SPIRAM
# enabled with no physical chip present hangs on boot, so leave it off
# unless/until that's confirmed.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
